Revit 2027 API
AreaLoad.IsValidHostId Method
 Indicates if the provided host id can host area loads.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidHostId(
	Document doc,
	ElementId hostId
)
Public Shared Function IsValidHostId (
	doc As Document,
	hostId As ElementId
) As Boolean
public:
static bool IsValidHostId(
	Document^ doc,
	ElementId^ hostId
)
static member IsValidHostId :
        doc : Document *
        hostId : ElementId -> bool
Parameters
doc Document
 The document containing both the host and the load.
hostId ElementId
 The id of the analytical element that is about to host an area load.
Return Value
Boolean
 True if an area load can be placed on the input host id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace